{
  "header": {
    "name": "Jay Gehlot",
    "title": "Senior Software Engineer",
    "email": "Send me an InMail on LinkedIn :-)",
    "mobile": "* **** ****",
    "linkedin": "linkedin.com/in/jaygehlot",
    "github": "github.com/jaygehlot"
  },
  "profile": {
    "title": "PROFILE",
    "expanded": true,
    "items": [
      "I’m a seasoned senior software engineer experienced with a plethora of technologies, having worked with globally dispersed teams and well versed with Agile methodologies - a Certified Scrum Master. I’m able to fit easily into or lead any agile team, taking a humble pragmatic approach and value-driven.  I will seek to and actively encourage pair/mob programming, advocate ATTD, TDD and help in defining or supporting the teams test approach, DoR and DoD; looking to add value to the agile team immediately. I’m keen to develop and mentor junior, mid-level and senior software engineers wherever the opportunity arises.",
      "I'm at home walking all the way up and down the language/technology stack chasing problems; flipping between layers of abstraction; and talking to both technical and non-technical people… all with the goal of building something that makes the world a little bit better."
    ]
  },
  "currentStudy": {
    "title": "Currently Studying and Reading",
    "expanded": false,
    "items": [
      "AWS Certified Developer Associate DVA-C01 exam",
      "Site Reliability Engineering by Betsy Beyer"
    ]
  },
  "technicalSkills": {
    "title": "TECHNICAL SKILLS",
    "expanded": true,
    "items": [
      {
        "name": "Languages",
        "expanded": true,
        "items": [
          "Java 8, have dabbled in Java 11",
          "Groovy",
          "Kotlin",
          "Node JS",
          "OOP",
          "Functional Programming",
          "A keen interest in Reactive Programming using WebFlux",
          "Design Patterns"
        ]
      },
      {
        "name": "Frameworks",
        "expanded": true,
        "items": [
          "Spring Framework (Core, MVC, WebFlux, JDBC, JaxRS, REST, Cache, Transaction Management, Security)",
          "Spring Boot",
          "Project Reactor",
          "JPA",
          "Maven",
          "Gradle",
          "NPM"
        ]
      },
      {
        "name": "Queues",
        "expanded": true,
        "items": [
          "Rabbit MQ",
          "Kafka"
        ]
      },
      {
        "name": "Web Frameworks",
        "expanded": true,
        "items": [
          "React JS",
          "HTML",
          "Java Script",
          "CSS",
          "Material UI"
        ]
      },
      {
        "name": "Processes",
        "expanded": true,
        "items": [
          "Agile",
          "Scrum",
          "Kanban",
          "Continuous Integration (CI)",
          "Continuous Delivery (CD)",
          "GitLab Pipelines",
          "Azure",
          "Jenkins",
          "Concourse",
          "Pair Programming"
        ]
      },
      {
        "name": "Test Driven Development (TDD)",
        "expanded": true,
        "items": [
          "JUnit",
          "Mockito",
          "SpringTest (test slices)"
        ]
      },
      {
        "name": "Behaviour Driven Development (BDD)",
        "expanded": true,
        "items": [
          "Cucumber",
          "JBehave",
          "Spock",
          "Wiremock"
        ]
      },
      {
        "name": "Protocols",
        "expanded": true,
        "items": [
          "REST Services (JSON and XML)",
          "Web Services",
          "SOAP",
          "HTTP/S",
          "TCP",
          "FTP",
          "SNMP",
          "SMPP",
          "SS7",
          "TLS"
        ]
      },
      {
        "name": "Cloud & Container",
        "expanded": true,
        "items": [
          "Cloud Foundry",
          "PCF",
          "AWS",
          "Docker",
          "Kubernetes",
          "Google Cloud Platform (GCP)",
          "Azure"
        ]
      },
      {
        "name": "Tools",
        "expanded": true,
        "items": [
          "IntelliJ Idea",
          "XCode",
          "Eclipse",
          "Jira",
          "Nexus",
          "Jacoco",
          "Git (GitHub, GitLab)",
          "Terraform",
          "Kibana",
          "Prometheus",
          "Apigee"
        ]
      },
      {
        "name": "Databases",
        "expanded": true,
        "items": [
          "Oracle",
          "SQL Server",
          "MongoDB",
          "Elastic Search"
        ]
      },
      {
        "name": "Application Servers",
        "expanded": true,
        "items": [
          "Apache Server",
          "Tomcat",
          "Jetty",
          "OC4J",
          "JBoss"
        ]
      },
      {
        "name": "Operating Systems",
        "expanded": true,
        "items": [
          "Linux",
          "Solaris",
          "Shell/Bash Script"
        ]
      }
    ]
  },
  "careerHistory": {
    "title": "CAREER HISTORY",
    "expanded": true,
    "items": [
      {
        "expanded": true,
        "company": "Vodafone",
        "period": "2019/02 – Present",
        "title": "Senior Software Engineer",
        "logo": "/reactjs-cv/static/images/vodafone.png",
        "items": [
          "Part of a team of backend Java devs designing and developing several Java 8 microservices and AWS lambdas such as product, inventory, catalogue as part of a digital platform across website & apps ensuring high availability.",
          "Team Lead from June 2020 for group of 4 software engineers.",
          "Developed & supported (through go live) new microservice for mobile switching as part of Ofcom regulation with tight deadlines and regular changing requirements.",
          "Implemented inventory and product services changes for iPhone 12 release (Oct 2020) and support release in prod, with increased data load out-of-hours using a tailored <b>application scaling policy</b> within the CloudFormation templates.",
          "Followed a TDD approach with unit, integration and acceptance test - pomodoro pairing service development style.",
          "Use of SonarQube within pipeline for static analysis and a final check of code quality",
          "Took part in team hackathon to build and demonstrate a POC using Resilience4J for circuit breaking and retry mechanism",
          "Implemented and fine tuned ElasticSearch queries (repository layer) using Java as part of service development.",
          "Drove refactoring of existing microservices ensuring loose coupling, increase test coverage, apply SOLID, DRY & KISS principles, whilst encouraging pair/mob programming within team and encouraging daily feature deployments to prod with safety first mindset",
          "Lead team in migration from EC2 to Fargate, working closely with devops colleagues on best practises for maintaining CloudFormation templates, changing env vars relevant for the Fargate stack - deployed to prod with close monitoring and logging using Datadog and CloudWatch",
          "Daily AWS usage, additionally attending AWS Meetups, GameDays arranged by Amazon and daily troubleshooting stack issues.",
          "Act as PO and SM (whilst away) during sprint meetings",
          "Train/mentor junior/mid level develops whilst remote pairing on features over Slack.",
          "Interview potential new starters for Lead, Senior and Mid/Junior Engineers",
          "Development and support maintenance of libraries used by all backend services",

          "<b>Tech Used:</b> SonarQube, Java 8/11, Springboot 2, Docker, CloudFormation, Pair programming, Cucumber BDD, Maven, ECS/EC2/Fargate/S3/CloudWatch, Cl, AWS Systems manager, Azure, devops, ElasticSearch, Kibana, Datadog, Lombok, Jira, Maven, OpenAPI."
        ]
      },
      {
        "expanded": true,
        "company": "Concur Solutions",
        "period": "2017/10 – 2019/01",
        "title": "Senior Software Engineer",
        "logo": "/reactjs-cv/static/images/mastercard.png",
        "items": [
          "Developed microservices using <b>Java 11</b>, <b>Kotlin</b>, <b>Spring Boot</b>, <b>Akka</b> backed with <b>Casandra</b>, <b>VoltDB</b> and <b>Oracle DB</b>.",
          "Break down Java based SWB expense auditing system to smaller, self contained, microservices, using <b>Java 11</b>, <b>Spring Boot</b> backed by <b>RabbitMQ/Postgres</b> then migrated to <b>Kafka</b> for scaling and streaming APIs",
          "Investigation / use of reactive framework <b>rxjava</b> for creation of non-blocking APIs (concept of backpressure)",
          "Additionally involved in adding new business features with a test first approach, a full CI/CD pipeline with ample unit, integration and acceptance test coverage straight to prod.",
          "Containerised and deployed microservices using <b>Docker</b> and <b>AWS</b>",
          "Actively led the team whenever the opportunity arose.",
          "Discussions with non-technical product teams, regular demonstrations internally / externally, training/technical development of junior & mid-level engineers",
          "Migrated RabbitMQ cluster across multiple global regions in prod working closely with Prague based devs",
          "Interview mid-level and senior devs for the team",
          "<b>Tech Used:</b> Java 8, Springboot, Docker, puppet, pair programming, BDD, Gradle, AWS EC2/SNS/S3/ALB, iac, training, management, development, devops, agile, engineering, quality, cloud, aws, some kubernetes."
        ]
      },
      {
        "expanded": true,
        "company": "moo.com",
        "period": "2017/07 – 2017/10 (1y 3m)",
        "title": "Software Engineer",
        "logo": "/reactjs-cv/static/images/hsbc.png",
        "items": [
          "Part of the Merchandise & Marketing crew in the eCom tribe working on legacy and new backend services.",
          "Developed and integrated operable microservices using <b>Java 8</b>, <b>Spring Boot</b> backed with <b>MongoDB</b>.",
          "Creation and improvement of ecommerce product set-up, including Experiments Platform, as well as Pricing and Product services.",
          "Engineered experiments platform pairing with junior/mid-level devs using S3, lambdas and Optimizely (https://bit.ly/3cJVboD) for tech measures of success baseline for new shipping & pricing tool",
          "Actively participated in Agile Guild to help improve agile working practises across teams.",
          "Worked in agile environment with engineers using <b>TDD</b> for Unit, Integration and Acceptance Tests, once committed to master the feature code would make its way through a <b>CI</b> and <b>CD</b> pipeline.",
          "Interviewed and on-boarded automation testers and software engineers.",
          "Mentor and develop junior / mid-level engineers.",        
          "<b>Tech Used:</b>  Java 6/8, Spring, docker, pair programming, Gradle, AWS S3/lambdas, interview, mentor, agile, engineering, quality, culture"
        ]
      },
      {
        "expanded": false,
        "company": "Marks & Spencer",
        "period": "2015/01 – 2017/07",
        "title": "Software Engineer",
        "logo": "/reactjs-cv/static/images/mns.jpeg",
        "items": [
          "<b>Mentored</b> and <b>guided</b> team members to improve their technical skills focusing on <b>TDD</b>, <b>Agile</b> and <b>CI</b> / <b>CD</b>.",
          "Designed, created highly available (with multiple EC2 instances in different AZs) microservices; used Apigee, Java 8, Springboot, Gradle and Postgres (RDS) deployed to AWS using Concourse for flexible pipelines;",
          "Used <b>AWS</b>, <b>Cloud Foundry</b> and <b>Docker</b> to deploy microservices, such as Product, Price, Category etc.",
          "Built <b>AWS</b> infrastructure using <b>Terraform</b> such as VPC, Subnet, EC2, RDS, S3, Routing, Volumes, Lambda, etc.",
          "Worked in <b>Agile</b> environment using <b>Scrum</b> and <b>Kanban</b> with <b>TDD</b> (Mockito), <b>BDD</b> and <b>Pair Programming</b>.",
          "Created pipeline to build, release, deploy and deliver microservices using <b>Concourse CI</b> and <b>CD</b> tool.",
          "Designed and created and maintainable microservices using <b>Pingdom</b> and <b>Loggly</b> tool.",
          "Used <b>RabbitMQ</b> and <b>Kafka</b> to retrieve and store xml data exported from SAP system.",
          "<b>Tech used:</b> Java 8, Springboot, Docker, Terraform, Pair programming, BDD, Gradle, AWS EC2/SNS/S3/, Concourse mentoring, agile, apigee, terragrunt, trello, Jira, swagger, mockito, dor, dod, CircleCI, nosql, postgres, mongodb, prometheus, grafana, Node JS, Swagger."
        ],
        "projectTitle": "Projects",
        "projectItems": [
          "<b>Product Services – Microservices:</b> Provides REST APIs for marksandspencer.com and mobile app to sell products online.",
          "<b>Price Services – Microservices:</b> Provides REST APIs for third parties and customer services."
        ]
      },
      {
        "expanded": false,
        "company": "Yell.com",
        "period": "2012/09 – 2015/01 ",
        "title": "Lead Engineer in Test",
        "logo": "/reactjs-cv/static/images/sky.png",
        "items": [
          "Support/mentor/guide/trained Devs in Test working in various SCRUM teams; Led test engineers in India",
          "Pairing with all members of multiple disciplined teams on dev & test tasks with deliver features to prod mindset",
          "Responsible for “tearing apart and refactoring” existing test automation framework and make fit for use in SCRUM teams, mainly using RestAssured, WebDriver, Junit, Jbehave for BDD;",
          "Jenkins pipeline creation and training for CI into Artifactory for automation framework + running of tests",
          "Introduced use of wraith for FE image differentiation.",
          "The go-to-person for questions, additions to Yells test automation automation framework;",
          "Regular resourcing, team moves, promotions, R & R discussions with Head of Dev and management team;",
          "Led recruitment process from talking to external recruiters, interviews and offer to onboarding for Devs in Test",
          "<b>Tech used:</b> Java 7, some Spring, Pair programming, Gherkin, Maven, Archiva SCRUM, Jira, swagger, mockito, dor, dod, Jenkins, RestAssured, JAXB, apache commons, wraith, appium, artifactory, webdriver, linux"
        ]
      },
      {
        "expanded": false,
        "company": "Fiserv",
        "period": "2007/09 – 2012/09",
        "title": "Senior Developer in Test",
        "logo": "/reactjs-cv/static/images/salmon.png",
        "items": [
          "Java RESTFul API testing of SOX compliance project on financial reconciliation software used by Tier 1 investment bank",
          "Use of Cucumber JVM + pairing with senior / principal devs to create features/tests",
          "Travel to Baltimore to lead Business Scenario Testing with Presales and Senior Stakeholders using production data",
          "Developed custom test automation framework for use by entire engineering team using Maven and Java 7",

          
          "<b>Tech used:</b> ava, test, maven, eclipse/intellij, svn, qtp, mercury, offshore management, scrum, oracle, sql server, J2EE"
        ]        
      },
      {
        "expanded": false,
        "company": "Tescom",
        "period": "2007/04 – 2007/09",
        "title": "Test Automation Consultant",
        "logo": "/REACTJS-CV/public/static/images/vodafone.png",
        "items": [
          "Placed at Vodafone in Newbury HQ to automate (using Selenium) testing of Vodafone Mobile and Vodafone @ Home user journeys",
        
          "<b>Tech used:</b> java, webdriver, maven, eclipse, mysql, svn"
        ]
      },
      {
        "expanded": false,
        "company": "SDL International",
        "period": "2008/04 – 2009/11 (1y 8m)",
        "title": "Lead Tester / Automation Developer",
        "logo": "/reactjs-cv/static/images/bnp.png",
        "items": [
          "Part of Microsoft Office 2007 localisation test team, involving daily calls with the Microsoft development team.",
          "Assigned tasks to other testers in the team. Reported on results daily. Defect triage.",
          
          "<b>Tech used:team management, mercury test suite, shell scripting, qtp"
        ]
      }
    ]
  },
  "education": {
    "title": "EDUCATION",
    "expanded": true,
    "items": [
      {
        "title": "Feb 2004 – July 2004",
        "detail": "MSc in Network Centred Computing - Reading University"
      },
      {
        "title": "Oct 2000 – Oct 2003",
        "detail": "BSc in Computer Science - Reading University"
      }
    ]
  },
  "courses": {
    "title": "Certifications and Conferences",
    "expanded": true,
    "items": [
      {
        "title": "ScrumAlliance Certified SCRUM Master (CSM) - active through to 20/02/2022"
      },
      {
        "title": "Regular attendee of The Lead Developer (https://bit.ly/3fZ7HT8) and Software Craftsman Conference (https://sc-london.com/) "
      }
    ]
  }
}